# Cos

## Description
Function Cos returns the cosine of the specified value. The base value is assumed to represent an angle in radians.

```pascal
FUNCTION Cos(v : REAL): REAL;
```

```python
def vs.Cos(v):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|v|REAL|The angle for which to find the cosine.|

## Version
Availability: from All Versions

## Category
* Math - General